src/InformationRegisters/СтатистикаСправочников/СтатистикаСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСправочников</name>
  <comment>Вспомогательная информация для использования в отборах</comment>
  <resources>
    <name>КоличествоНеактуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАктуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПомеченных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВалют</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСвободных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДляНакоплений</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКредиток</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБезналичных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаличных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВзатыхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВыданныхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Контакты</types>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.КошелькиИСчета</types>
      <types>CatalogRef.СтатьиДоходов</types>
      <types>CatalogRef.Имущество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КлючиСтатей/КлючиСтатей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючиСтатей</name>
  <resources>
    <name>РодительскаяСтатья</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РодительскаяСтатьяВБюджете</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </resources>
  <resources>
    <name>ИсключатьИзБюджета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаДебетовая</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаКредитная</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/СтатистикаСправочников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удаляет из РС СтатистикаСправочников все записи для ссылок указанного справочника
//
//Параметры:
//	ИмяСправочника - Строка - Имя метаданных справочника, статистику которого нужно очистить
//
Процедура ОчиститьСтатистикуСправочника(ИмяСправочника) Экспорт
	
	// Удаление статистики по всем кошелькам
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатистикаСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатистикаСправочников КАК СтатистикаСправочников
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СтатистикаСправочников.Ссылка) = ТИП(Справочник." + ИмяСправочника + ")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.СтатистикаСправочников.СоздатьМенеджерЗаписи();
		Запись.Ссылка = Выборка.Ссылка;
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Обновляет записи РС СтатистикаСправочников для всех справочников
//
//Параметры:
//	нет
//
Процедура ОбновитьВсюСтатистикуСправочников() Экспорт
	
	Типы = Метаданные.РегистрыСведений.СтатистикаСправочников.Измерения.Ссылка.Тип.Типы();
	Для каждого Тип Из Типы Цикл
		
		МетаданныеЗначения = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеЗначения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Справочники[МетаданныеЗначения.Имя].ОбновитьРегистрСтатистики();
		Исключение
			ЗаписьЖурналаРегистрации("Дополнительная информация.Обновление статистики справочников",
				УровеньЖурналаРегистрации.Ошибка, МетаданныеЗначения, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			// Прерывание не требуется
		КонецПопытки; 
		 
	КонецЦикла;
	
КонецПроцедуры

// Обновляет информационные реквизиты по указанному или всем контактам
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	ИмяСправочника - Строка - Имя объекта метаданных 
//	Ссылка - СправочникСсылка или Неопределено. Чтобы обновить сатистику всего справочника ссылка = Неопеделено
//
Процедура ОбновитьСтатистикуСправочника(ИмяСправочника, Ссылка = Неопределено) Экспорт
	
	ТипыСтатей  = РегистрыСведений.КлючиСтатей.ТипыСтатейПоТипуСправочника(Тип("СправочникСсылка." + ИмяСправочника));
	Если ТипыСтатей = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Неизвестный тип статьи для обновления статистики справочника ""%1""'"), Ссылка);
	КонецЕсли;
	
	Если Ссылка = Неопределено Тогда
		
		Ключ = Неопределено;
		ОчиститьСтатистикуСправочника(ИмяСправочника);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(ИмяСправочника) И ЗначениеЗаполнено(Ссылка) Тогда
			ИмяСправочника = Ссылка.Метаданные().Имя;
		КонецЕсли;
		
		Ключ = РегистрыСведений.КлючиСтатей.КлючСтатьиБюджета(Ссылка);
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru='Обшибка обновления статистики: нет ключа для ссылки <%1>'"), Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаУчета", ПараметрыСеанса.ВалютаУчета);
	Запрос.УстановитьПараметр("ТипыСтатей", ТипыСтатей);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Ключ2", ?(Ключ = Неопределено, "", Ключ + "яяя"));
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	КлючиСтатей.Ключ КАК Ключ,
	|	//ДополнительныеРеквизиты
	|	СУММА(ВЫБОР
	|			КОГДА Потомки.Активность
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоАктуальных,
	|	СУММА(ВЫБОР
	|			КОГДА Потомки.Активность
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоНеАктуальных,
	|	СУММА(ВЫБОР
	|			КОГДА Потомки.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПомеченных
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Спр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлючиСтатей КАК КлючиСтатей
	|		ПО (Спр.Ссылка = КлючиСтатей.СтатьяБюджета  И КлючиСтатей.ТипСтатьи В (&ТипыСтатей))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочника + " КАК Потомки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлючиСтатей КАК КлючиПотомков
	|			ПО (Потомки.Ссылка = КлючиПотомков.СтатьяБюджета И КлючиПотомков.ТипСтатьи В (&ТипыСтатей))
	|		ПО (КлючиПотомков.Ключ МЕЖДУ КлючиСтатей.Ключ И КлючиСтатей.Ключ + ""яяя"")
	|ГДЕ
	|	КлючиСтатей.ТипСтатьи В (&ТипыСтатей) И
	|	(&Ключ = НЕОПРЕДЕЛЕНО
	|			ИЛИ (&Ключ МЕЖДУ КлючиСтатей.Ключ И КлючиСтатей.Ключ + ""яяя""
	|				ИЛИ КлючиСтатей.Ключ МЕЖДУ &Ключ И &Ключ2) 
	|	)
	|
	|СГРУППИРОВАТЬ ПО
	|	Спр.Ссылка,
	|	КлючиСтатей.Ключ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ключ";
	#КонецОбласти 

	// Уточнение текста запроса
	ДопПоля = "";
	ЕстьВалюты = Ложь;
	Если ИмяСправочника = "КошелькиИСчета" Тогда
		ДопПоля = 
		"СУММА(ВЫБОР
		|		КОГДА НЕ Потомки.ЭтоГруппа
		|				И Потомки.ИспользоватьДляНакоплений
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоДляНакоплений,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ Потомки.ЭтоГруппа
		|				ИЛИ НЕ Потомки.ИспользоватьДляНакоплений
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоСвободных,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ Потомки.ЭтоГруппа
		|				И Потомки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Наличность)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоНаличных,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ Потомки.ЭтоГруппа
		|				И Потомки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.БанковскаяКартаКредитная)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоКредиток,
		|	СУММА(ВЫБОР
		|		КОГДА Потомки.ЭтоГруппа
		|				ИЛИ Потомки.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.БанковскаяКартаКредитная), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Наличность))
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ) КАК КоличествоБезналичных,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА Потомки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА &ВалютаУчета
		|			ИНАЧЕ Потомки.Валюта
		|		КОНЕЦ) КАК КоличествоВалют,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Потомки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА &ВалютаУчета
		|			ИНАЧЕ Потомки.Валюта
		|		КОНЕЦ) КАК Валюта,";
	ИначеЕсли ИмяСправочника = "Контакты" Или ИмяСправочника = "Имущество" Тогда
		ДопПоля = 
		"КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА Потомки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА &ВалютаУчета
		|			ИНАЧЕ Потомки.Валюта
		|		КОНЕЦ) КАК КоличествоВалют,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Потомки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА &ВалютаУчета
		|			ИНАЧЕ Потомки.Валюта
		|		КОНЕЦ) КАК Валюта,";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДопПоля) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ДополнительныеРеквизиты", ДопПоля);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.СтатистикаСправочников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать(Истина);
		
	КонецЦикла;

	
КонецПроцедуры
 


#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
